SAMPLE/constant/wavemakerMovement.txt
wavemakerType   Piston;
tSmooth         1.5;
genAbs          0;

timeSeries 621(
0.0
0.05
0.1
0.15
0.2
0.25
0.3
0.35
0.4
0.45
0.5
0.55
0.6
0.65
0.7
0.75
0.8
0.85
0.9
0.95
1.0
1.05
1.1
1.15
1.2
1.25
1.3
1.35
1.4
1.45
1.5
1.55
1.6
1.65
1.7
1.75
1.8
1.85
1.9
1.95
2.0
2.05
2.1
2.15
2.2
2.25
2.3
2.35
2.4
2.45
2.5
2.55
2.6
2.65
2.7
2.75
2.8
2.85
2.9
2.95
3.0
3.05
3.1
3.15
3.2
3.25
3.3
3.35
3.4
3.45
3.5
3.55
3.6
3.65
3.7
3.75
3.8
3.85
3.9
3.95
4.0
4.05
4.1
4.15
4.2
4.25
4.3
4.35
4.4
4.45
4.5
4.55
4.6
4.65
4.7
4.75
4.8
4.85
4.9
4.95
...
);

paddlePosition 1(
621(
3.36777869766e-19
0.00363322556409
0.00545528798207
0.00455788903709
0.00138838215321
-0.0024732333114
-0.00510194183249
-0.00518733206586
-0.00268683697543
0.00115304649694
0.00441813622635
0.00548078480079
0.00381126184672
0.000241824649732
-0.00344816214861
-0.00541923992379
-0.00468882629505
-0.00162103249703
0.00225484609107
0.00500668377716
0.00526268932141
0.00289524394577
-0.00091548069813
-0.00426983816301
-0.00549568106577
-0.00398192665108
-0.000483181579003
0.00325642953712
0.00537271034758
0.00481069475047
0.00185054755225
-0.00203209770386
-0.00490174214139
-0.00532786784837
-0.00309805113612
0.000676144240062
0.00411328167491
0.00549994796567
0.00414488988915
0.000723603971984
-0.00305839856553
-0.00531578924775
-0.00492325869383
-0.00207648340677
0.00180541897424
0.00478731989602
0.00538274158293
0.00329486629089
-0.000435500030711
-0.00394876956274
-0.00549357724777
-0.00429983636874
-0.00096262682036
0.0028544522516
0.00524858671712
0.00502630041176
0.00229840307114
-0.00157524832849
-0.00466363834861
-0.00542720439214
-0.00348530874385
0.000194013507412
0.00377662001442
0.00547658123385
0.00444646640312
0.00119978782272
-0.00264498505414
-0.00517123273416
-0.00511962060812
-0.00251587732373
0.0013420309467
0.00453093671544
0.00546117027912
0.00366901015442
4.78482633533e-05
-0.00359716598966
-0.00544899279644
-0.00458449639064
-0.0014346282787
0.00243040211008
0.0050838769116
0.00520303878947
0.00272848554093
-0.00110621790176
-0.00438947165879
-0.00548457354939
-0.00384561522008
-0.000289617489327
0.00341075457599
0.00541086529517
0.00471365936328
0.0016666939762
-0.00221111845087
-0.00498668820699
-0.00527639361413
-0.00293581651069
0.000868265286884
0.00423951679058
0.00549736893799
...
);

paddleEta 1(
621(
0.0055
0.0041291248468
0.000699880727445
-0.00307825397353
-0.00532187889722
-0.00491254689417
-0.0020543099907
0.00182800055757
0.00479905272606
0.00537777684326
0.00327567890451
-0.000459345150624
-0.00396538562258
-0.00549468114077
-0.00428487780419
-0.000939062643516
0.00287487529727
0.00525568774221
0.00501653955487
0.00227664611997
-0.00159815553257
-0.00467627656309
-0.0054232734664
-0.00346676824459
0.000217921140278
0.00379397682458
0.00547873485047
0.00443234324819
0.00117642828977
-0.00266593623664
-0.00517933140056
-0.00511082957278
-0.00249457891824
0.001365219466
0.00454445587039
0.00545828077023
0.00365115240203
2.39243580199e-05
-0.0036152299798
-0.00545219197128
-0.00457123596135
-0.00141151857003
0.00245184090708
0.00509295755543
0.00519523457867
0.00270768687503
-0.00112964288666
-0.00440384560642
-0.00548273104604
-0.00382847475378
-0.000265723583484
0.00342949080799
0.00541510384062
0.00470128730704
0.001643878789
-0.00223300339694
-0.0049967332651
-0.00526959132226
-0.0029155578117
0.000891881430407
0.00425471772977
0.00549657700382
0.00399839233526
0.000507008864827
-0.00323711855297
-0.00536754219177
-0.00482224574896
-0.00187305953165
0.00200984696653
0.00489084463993
0.00533375598787
0.00311778967871
-0.000652394958965
-0.00409736067326
-0.00549979186367
-0.00416057650366
-0.000747313524796
0.00303848528781
0.00530959901517
0.00493387733768
0.0020986175325
-0.00178280322955
-0.00477549648235
-0.00538760447266
-0.00331399133322
0.000411646670452
0.00393207878597
0.00549236940763
0.00431471357362
0.000986172782788
-0.0028339751952
-0.0052413863805
-0.00503596616314
-0.0023201165329
0.00155231131824
0.00465091189075
0.00543103262664
0.00350378329559
-0.000170102203506
...
);

